{
  "siteTitle": "Portafolio DevOps CI/CD",

  "nav": {
    "home": "Inicio",
    "about": "Sobre m칤",
    "skills": "Skills",
    "projects": "Proyectos",
    "cicd": "Demo CI/CD",
    "contact": "Contacto"
  },

  "home": {
    "title": "Hola, soy Julio Reyes",
    "subtitle": "Ingeniero DevOps en Chile, ayudando a equipos de Estados Unidos a automatizar sus despliegues en la nube."
  },

  "about": {
    "title": "Sobre m칤",
    "body": "Soy ingeniero DevOps en Chile, con experiencia trabajando para clientes bancarios y empresas de Estados Unidos. Me especializo en CI/CD, automatizaci칩n con Python y entornos en la nube (principalmente AWS)."
  },

  "skills": {
    "title": "Skills principales",
    "item1": "CI/CD con Jenkins, Tekton, GitHub Actions, AWS CodePipeline y CodeBuild.",
    "item2": "Infraestructura en AWS (Lambda, S3, CloudFront, ECS/EKS, networking, IAM b치sico).",
    "item3": "Automatizaci칩n con Python y Bash para build, deploy y tareas de mantenimiento.",
    "item4": "Contenedores con Docker y despliegues en Kubernetes/OpenShift."
  },

  "projects": {
    "title": "Proyectos",
    "platformTitle": "Plataforma CI/CD multi-entorno",
    "platformBody": "Dise침o y automatizaci칩n de pipelines desde desarrollo hasta producci칩n, incluyendo an치lisis est치tico de c칩digo, construcci칩n de im치genes Docker y despliegues automatizados en Kubernetes/OpenShift.",
    "serverlessTitle": "Automatizaci칩n de despliegues serverless",
    "serverlessBody": "Implementaci칩n de pipelines para funciones AWS Lambda con pruebas automatizadas y despliegues controlados por rama, reduciendo el tiempo de entrega y los errores manuales en los releases."
  },

  "cicd": {
    "title": "Demo CI/CD (este sitio)",
    "body1": "Este portafolio se despliega como sitio est치tico en S3, usando CloudFront y un dominio custom gestionado en Route 53.",
    "body2": "Un pipeline de CodePipeline toma los cambios desde GitHub, ejecuta un proyecto de CodeBuild y sincroniza el sitio con el bucket S3.",
    "body3": "Para fines de demo, puedo usar este pipeline para introducir peque침os cambios visuales (por ejemplo, tema o ajustes de layout) en cada despliegue y rastrearlos en Git."
  },

  "contact": {
    "title": "Contacto",
    "email": "游닎 Email: julioreyesrepiso@gmail.com",
    "linkedin": "游댕 LinkedIn: https://www.linkedin.com/in/julio-reyes-repiso-78a87454/",
    "location": "游늸 Ubicaci칩n: Santiago, Chile (disponible remoto para USA / Latam)",
    "footer": "Portafolio est치tico construido para demostrar skills de DevOps / CI-CD en AWS."
  },

  "footer": {
    "text": "춸 2025 Julio Reyes - Portafolio DevOps CI/CD"
  }
}
