{
  "siteTitle": "Portafolio DevOps CI/CD",

  "nav": {
    "home": "Inicio",
    "about": "Sobre m铆",
    "skills": "Skills",
    "projects": "Proyectos",
    "cicd": "Demo CI/CD",
    "contact": "Contacto"
  },

  "home": {
    "title": "Hola, soy Julio Reyes",
    "subtitle": "Ingeniero DevOps en Chile, apoyando a equipos de Estados Unidos a automatizar sus despliegues en la nube."
  },

  "about": {
    "title": "Sobre m铆",
    "body": "Soy ingeniero DevOps en Chile, con experiencia trabajando para clientes del sector bancario y empresas en Estados Unidos. Me enfoco en CI/CD, automatizaci贸n con Python y Bash, y entornos en la nube (principalmente AWS)."
  },

  "skills": {
    "title": "Skills principales",
    "item1": "CI/CD con Jenkins, Tekton, GitHub Actions y AWS CodePipeline.",
    "item2": "Infraestructura en AWS (Lambda, S3, ECS/EKS, CloudFront, etc.).",
    "item3": "Scripting con Python y Bash para automatizar tareas repetitivas.",
    "item4": "Contenedores (Docker) y despliegues en Kubernetes/OpenShift."
  },

  "projects": {
    "title": "Proyectos",
    "platformTitle": "Plataforma CI/CD multi-entorno",
    "platformBody": "Dise帽o y automatizaci贸n de pipelines desde desarrollo hasta producci贸n, incorporando an谩lisis est谩tico de c贸digo, creaci贸n de im谩genes Docker y despliegues automatizados en Kubernetes.",
    "serverlessTitle": "Automatizaci贸n de despliegues serverless",
    "serverlessBody": "Implementaci贸n de pipelines para funciones AWS Lambda con pruebas automatizadas y despliegues controlados por rama, reduciendo el tiempo de entrega y errores manuales."
  },

  "cicd": {
    "title": "Demo CI/CD",
    "body1": "Esta secci贸n est谩 conectada a un pipeline que despliega este sitio est谩tico a S3 y CloudFront.",
    "body2": "Cada push a la rama main dispara un pipeline en AWS CodePipeline + CodeBuild.",
    "body3": "A futuro quiero extender esta demo para que cada despliegue cambie el tema o colores del sitio, como indicador visual del flujo de CI/CD."
  },

  "contact": {
    "title": "Contacto",
    "email": " Email: julioreyesrepiso@gmail.com",
    "linkedin": " LinkedIn: https://www.linkedin.com/in/julio-reyes-repiso-78a87454/",
    "location": " Ubicaci贸n: Santiago, Chile (disponible remoto para USA / Latam)",
    "footer": "Portafolio est谩tico creado para demostrar habilidades de DevOps y CI/CD."
  },

  "footer": {
    "text": "漏 2025 Julio Reyes - Portafolio DevOps CI/CD"
  }
}
