{
  "siteTitle": "Portafolio DevOps CI/CD",
  "nav": {
    "home": "Inicio",
    "about": "Sobre mí",
    "skills": "Skills",
    "projects": "Proyectos",
    "cicd": "CI/CD Demo",
    "contact": "Contacto"
  },
  "home": {
    "title": "Hola, soy Julio Reyes",
    "subtitle": "DevOps Engineer especializado en automatización CI/CD y AWS Cloud. Trabajo desde Chile con equipos en Estados Unidos, ayudando a optimizar despliegues, mejorar pipelines y crear infraestructura segura, estable y reproducible mediante IaC."
  },
  "about": {
    "title": "Sobre mí",
    "body": "Soy ingeniero DevOps con más de 4 años de experiencia trabajando con empresas en Estados Unidos (banca, plataformas enterprise y SaaS). Me enfoco en automatizar procesos, mejorar flujos de entrega y desplegar entornos cloud eficientes, seguros y confiables utilizando buenas prácticas DevOps, contenedores y Terraform."
  },
  "skills": {
    "title": "Skills principales",
    "item1": "CI/CD Pipelines con Jenkins, GitHub Actions, Tekton, TeamCity y AWS CodePipeline.",
    "item2": "AWS Cloud: Lambda, S3, EC2, CloudFront, API Gateway, DynamoDB, EKS/ECS.",
    "item3": "Infraestructura como Código con Terraform y CloudFormation.",
    "item4": "Contenedores y orquestación: Docker, Kubernetes y OpenShift.",
    "item5": "Automatización con Python y Bash para tareas complejas y bots internos.",
    "item6": "Git & DevOps Practices: modelos de branching, hooks, quality gates y seguridad."
  },
  "projects": {
    "title": "Proyectos",
    "platformTitle": "Plataforma CI/CD multi-entorno",
    "platformBody": "Automatización completa de pipelines desde desarrollo a producción: análisis estático de código, empaquetado Docker, deployments en Kubernetes/OpenShift, integración con quality gates y approvals. Reducción del tiempo de despliegue entre 40% y 60%.",
    "serverlessTitle": "Automatización de despliegues serverless (AWS Lambda)",
    "serverlessBody": "Pipelines automáticos para funciones Lambda con pruebas, versioning, aliases y despliegues controlados por rama. Entrega más rápida y confiable sin intervenciones manuales.",
    "portfolioTitle": "Portafolio DevOps IaC (este sitio)",
    "portfolioBody": "Infraestructura completa en AWS gestionada con Terraform: S3 privado con OAC, CloudFront con HTTPS (ACM), dominio en Route 53 y despliegue automático vía CodeBuild en cada push."
  },
  "cicd": {
    "title": "CI/CD Demo",
    "body1": "Este demo muestra un pipeline CI/CD real implementado en AWS. Cada push en GitHub ejecuta CodeBuild, que reconstruye y publica el sitio en un bucket S3 privado.",
    "body2": "CloudFront utiliza Origin Access Control (OAC) para acceder al bucket y entregar el sitio con HTTPS y caching global.",
    "body3": "Toda la infraestructura está definida con Terraform para asegurar reproducibilidad y buenas prácticas de IaC."
  },
  "contact": {
    "title": "Contacto",
    "email": "📧 Email: julioreyesrepiso@gmail.com",
    "linkedin": "🔗 LinkedIn: https://www.linkedin.com/in/julio-reyes-repiso-78a87454/",
    "location": "📍 Ubicación: Santiago, Chile — Disponible remoto para USA",
    "footer": "Portafolio construido con CI/CD real, IaC y buenas prácticas DevOps."
  },
  "footer": {
    "text": "© 2025 Julio Reyes - Portafolio DevOps CI/CD"
  }
}